       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALTR.
       AUTHOR. CARLOS GOMES.
       DATE-WRITTEN. 01/03/96.
       DATE-COMPILED. 01/03/96.
       INSTALLATION. COLEGIO BRASILIA.
       SECURITY. CANCELADO.
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PC486.
       OBJECT-COMPUTER. PC486.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
      *
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  BASE PIC 9(02).
       01  ALT  PIC 9(02).
       01  RES  PIC 9(04).
       SCREEN SECTION.
       01  TELA.
           03 LINE 01 COLUMN 01 VALUE "BY CARLOS GOMES".
           03 LINE 01 COLUMN 55 VALUE "ALL RIGHTS RESERVED".
           03 LINE 04 COLUMN 26 VALUE "CALCULO DA AREA DO TRIANGULO".
           03 LINE 08 COLUMN 25 VALUE "BASE:".
           03 LINE 11 COLUMN 25 VALUE "ALTURA:".
           03 LINE 14 COLUMN 25 VALUE "RESULTADO:".
      *
       PROCEDURE DIVISION.
       001-START.
           DISPLAY TELA.
           ACCEPT (08 31) BASE.
           ACCEPT (11 33) ALT.
           MULTIPLY BASE BY ALT GIVING RES.
           DIVIDE 2 INTO RES.
           DISPLAY (14 36) RES.
           DISPLAY (18 50) "PROGRAMA FINALIZADO!".
           STOP " ".
           STOP RUN.


